"use strict";

module.exports = {
    Rule1: {
        /// mode: 1 -- 大小/三军
        PointSmall: "0",        // 小
        PointBig: "7",          // 大
        Point1: "1",            // 1点
        Point2: "2",            // 2点
        Point3: "3",            // 3点
        Point4: "4",            // 4点
        Point5: "5",            // 5点
        Point6: "6",            // 6点
    },
    Rule2: {
        /// mode: 2 -- 围骰/全骰
        PointAll: "777",        // 全骰
        Point111: "111",        // 3个1点
        Point222: "222",        // 3个2点
        Point333: "333",        // 3个3点
        Point444: "444",        // 3个4点
        Point555: "555",        // 3个5点
        Point666: "666"         // 3个6点
    },
    Rule3: {
        /// mode: 3 -- 点数
        Point4: "4",            // 点数和为4
        Point5: "5",            // 点数和为5
        Point6: "6",            // 点数和为6
        Point7: "7",            // 点数和为7
        Point8: "8",            // 点数和为8
        Point9: "9",            // 点数和为9
        Point10: "10",          // 点数和为10
        Point11: "11",          // 点数和为11
        Point12: "12",          // 点数和为12
        Point13: "13",          // 点数和为13
        Point14: "14",          // 点数和为14
        Point15: "15",          // 点数和为15
        Point16: "16",          // 点数和为16
        Point17: "17"           // 点数和为17
    },
    Rule4: {
        /// mode: 4 - 长牌
        Point12: "12",          // 点数1、2
        Point13: "13",          // 点数1、3
        Point14: "14",          // 点数1、4
        Point15: "15",          // 点数1、5
        Point16: "16",          // 点数1、6
        Point23: "23",          // 点数2、3
        Point24: "24",          // 点数2、4
        Point25: "25",          // 点数2、5
        Point26: "26",          // 点数2、6
        Point34: "34",          // 点数3、4
        Point35: "35",          // 点数3、5
        Point36: "36",          // 点数3、6
        Point45: "45",          // 点数4、5
        Point46: "46",          // 点数4、6
        Point56: "56"           // 点数5、6
    },
    Rule5: {
        Point11: "11",          // 点数1、1
        Point22: "22",          // 点数2、2
        Point33: "33",          // 点数3、3
        Point44: "44",          // 点数4、4
        Point55: "55",          // 点数5、5
        Point66: "66"           // 点数6、6
    }
}